; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l8-t1-p8---int100n150-m25---int100c150---s497---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level3 level3)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level15 level15)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level3 level4)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level15 level16)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level3 level5)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level15 level17)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level3 level6)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level15 level18)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level3 level7)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level15 level19)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level3 level8)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level15 level20)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level3 level9)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level15 level21)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level3 level10)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level15 level22)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level3 level11)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level15 level23)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level3 level12)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level15 level24)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level3 level13)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level15 level25)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level3 level14)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level15 level26)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level3 level15)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level15 level27)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level3 level16)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level15 level28)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level3 level17)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level15 level29)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level3 level18)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level15 level30)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level3 level19)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level15 level31)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level3 level20)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level15 level32)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level3 level21)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level15 level33)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level3 level22)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level15 level34)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level3 level23)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level15 level35)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level20 level23 level43)
(sum level21 level1 level22)
(sum level21 level3 level24)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level15 level36)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level21 level23 level44)
(sum level22 level1 level23)
(sum level22 level3 level25)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level15 level37)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level22 level23 level45)
(sum level23 level1 level24)
(sum level23 level3 level26)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level15 level38)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level23 level23 level46)
(sum level24 level1 level25)
(sum level24 level3 level27)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level15 level39)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level24 level23 level47)
(sum level25 level1 level26)
(sum level25 level3 level28)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level15 level40)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level25 level23 level48)
(sum level26 level1 level27)
(sum level26 level3 level29)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level15 level41)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level26 level23 level49)
(sum level27 level1 level28)
(sum level27 level3 level30)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level15 level42)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level27 level23 level50)
(sum level28 level1 level29)
(sum level28 level3 level31)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level15 level43)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level28 level23 level51)
(sum level29 level1 level30)
(sum level29 level3 level32)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level15 level44)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level29 level23 level52)
(sum level30 level1 level31)
(sum level30 level3 level33)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level15 level45)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level30 level23 level53)
(sum level31 level1 level32)
(sum level31 level3 level34)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level15 level46)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level31 level23 level54)
(sum level32 level1 level33)
(sum level32 level3 level35)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level15 level47)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level32 level23 level55)
(sum level33 level1 level34)
(sum level33 level3 level36)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level15 level48)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level33 level23 level56)
(sum level34 level1 level35)
(sum level34 level3 level37)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level15 level49)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level34 level23 level57)
(sum level35 level1 level36)
(sum level35 level3 level38)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level15 level50)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level3 level39)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level15 level51)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level36 level23 level59)
(sum level37 level1 level38)
(sum level37 level3 level40)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level15 level52)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level37 level23 level60)
(sum level38 level1 level39)
(sum level38 level3 level41)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level15 level53)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level38 level23 level61)
(sum level39 level1 level40)
(sum level39 level3 level42)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level15 level54)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level39 level23 level62)
(sum level40 level1 level41)
(sum level40 level3 level43)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level15 level55)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level40 level23 level63)
(sum level41 level1 level42)
(sum level41 level3 level44)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level15 level56)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level41 level23 level64)
(sum level42 level1 level43)
(sum level42 level3 level45)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level15 level57)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level42 level23 level65)
(sum level43 level1 level44)
(sum level43 level3 level46)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level15 level58)
(sum level43 level17 level60)
(sum level43 level18 level61)
(sum level43 level23 level66)
(sum level44 level1 level45)
(sum level44 level3 level47)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level15 level59)
(sum level44 level17 level61)
(sum level44 level18 level62)
(sum level44 level23 level67)
(sum level45 level1 level46)
(sum level45 level3 level48)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level15 level60)
(sum level45 level17 level62)
(sum level45 level18 level63)
(sum level45 level23 level68)
(sum level46 level1 level47)
(sum level46 level3 level49)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level15 level61)
(sum level46 level17 level63)
(sum level46 level18 level64)
(sum level46 level23 level69)
(sum level47 level1 level48)
(sum level47 level3 level50)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level15 level62)
(sum level47 level17 level64)
(sum level47 level18 level65)
(sum level47 level23 level70)
(sum level48 level1 level49)
(sum level48 level3 level51)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level15 level63)
(sum level48 level17 level65)
(sum level48 level18 level66)
(sum level48 level23 level71)
(sum level49 level1 level50)
(sum level49 level3 level52)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level15 level64)
(sum level49 level17 level66)
(sum level49 level18 level67)
(sum level49 level23 level72)
(sum level50 level1 level51)
(sum level50 level3 level53)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level15 level65)
(sum level50 level17 level67)
(sum level50 level18 level68)
(sum level50 level23 level73)
(sum level51 level1 level52)
(sum level51 level3 level54)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level15 level66)
(sum level51 level17 level68)
(sum level51 level18 level69)
(sum level51 level23 level74)
(sum level52 level1 level53)
(sum level52 level3 level55)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level15 level67)
(sum level52 level17 level69)
(sum level52 level18 level70)
(sum level52 level23 level75)
(sum level53 level1 level54)
(sum level53 level3 level56)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level15 level68)
(sum level53 level17 level70)
(sum level53 level18 level71)
(sum level53 level23 level76)
(sum level54 level1 level55)
(sum level54 level3 level57)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level15 level69)
(sum level54 level17 level71)
(sum level54 level18 level72)
(sum level54 level23 level77)
(sum level55 level1 level56)
(sum level55 level3 level58)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level15 level70)
(sum level55 level17 level72)
(sum level55 level18 level73)
(sum level55 level23 level78)
(sum level56 level1 level57)
(sum level56 level3 level59)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level15 level71)
(sum level56 level17 level73)
(sum level56 level18 level74)
(sum level56 level23 level79)
(sum level57 level1 level58)
(sum level57 level3 level60)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level15 level72)
(sum level57 level17 level74)
(sum level57 level18 level75)
(sum level57 level23 level80)
(sum level58 level1 level59)
(sum level58 level3 level61)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level15 level73)
(sum level58 level17 level75)
(sum level58 level18 level76)
(sum level58 level23 level81)
(sum level59 level1 level60)
(sum level59 level3 level62)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level15 level74)
(sum level59 level17 level76)
(sum level59 level18 level77)
(sum level60 level1 level61)
(sum level60 level3 level63)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level15 level75)
(sum level60 level17 level77)
(sum level60 level18 level78)
(sum level61 level1 level62)
(sum level61 level3 level64)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level15 level76)
(sum level61 level17 level78)
(sum level61 level18 level79)
(sum level62 level1 level63)
(sum level62 level3 level65)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level62 level15 level77)
(sum level62 level17 level79)
(sum level62 level18 level80)
(sum level63 level1 level64)
(sum level63 level3 level66)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level63 level15 level78)
(sum level63 level17 level80)
(sum level63 level18 level81)
(sum level64 level1 level65)
(sum level64 level3 level67)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level64 level15 level79)
(sum level64 level17 level81)
(sum level65 level1 level66)
(sum level65 level3 level68)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level65 level9 level74)
(sum level65 level15 level80)
(sum level66 level1 level67)
(sum level66 level3 level69)
(sum level66 level6 level72)
(sum level66 level8 level74)
(sum level66 level9 level75)
(sum level66 level15 level81)
(sum level67 level1 level68)
(sum level67 level3 level70)
(sum level67 level6 level73)
(sum level67 level8 level75)
(sum level67 level9 level76)
(sum level68 level1 level69)
(sum level68 level3 level71)
(sum level68 level6 level74)
(sum level68 level8 level76)
(sum level68 level9 level77)
(sum level69 level1 level70)
(sum level69 level3 level72)
(sum level69 level6 level75)
(sum level69 level8 level77)
(sum level69 level9 level78)
(sum level70 level1 level71)
(sum level70 level3 level73)
(sum level70 level6 level76)
(sum level70 level8 level78)
(sum level70 level9 level79)
(sum level71 level1 level72)
(sum level71 level3 level74)
(sum level71 level6 level77)
(sum level71 level8 level79)
(sum level71 level9 level80)
(sum level72 level1 level73)
(sum level72 level3 level75)
(sum level72 level6 level78)
(sum level72 level8 level80)
(sum level72 level9 level81)
(sum level73 level1 level74)
(sum level73 level3 level76)
(sum level73 level6 level79)
(sum level73 level8 level81)
(sum level74 level1 level75)
(sum level74 level3 level77)
(sum level74 level6 level80)
(sum level75 level1 level76)
(sum level75 level3 level78)
(sum level75 level6 level81)
(sum level76 level1 level77)
(sum level76 level3 level79)
(sum level77 level1 level78)
(sum level77 level3 level80)
(sum level78 level1 level79)
(sum level78 level3 level81)
(sum level79 level1 level80)
(sum level80 level1 level81)

(connected l0 l1)
(fuelcost level1 l0 l1)
(connected l0 l3)
(fuelcost level17 l0 l3)
(connected l0 l5)
(fuelcost level1 l0 l5)
(connected l1 l0)
(fuelcost level1 l1 l0)
(connected l1 l2)
(fuelcost level1 l1 l2)
(connected l2 l1)
(fuelcost level1 l2 l1)
(connected l2 l3)
(fuelcost level23 l2 l3)
(connected l2 l5)
(fuelcost level3 l2 l5)
(connected l2 l6)
(fuelcost level18 l2 l6)
(connected l2 l7)
(fuelcost level9 l2 l7)
(connected l3 l0)
(fuelcost level17 l3 l0)
(connected l3 l2)
(fuelcost level23 l3 l2)
(connected l3 l4)
(fuelcost level15 l3 l4)
(connected l3 l5)
(fuelcost level8 l3 l5)
(connected l4 l3)
(fuelcost level15 l4 l3)
(connected l4 l5)
(fuelcost level9 l4 l5)
(connected l5 l0)
(fuelcost level1 l5 l0)
(connected l5 l2)
(fuelcost level3 l5 l2)
(connected l5 l3)
(fuelcost level8 l5 l3)
(connected l5 l4)
(fuelcost level9 l5 l4)
(connected l5 l6)
(fuelcost level6 l5 l6)
(connected l6 l2)
(fuelcost level18 l6 l2)
(connected l6 l5)
(fuelcost level6 l6 l5)
(connected l7 l2)
(fuelcost level9 l7 l2)

(at t0 l7)
(fuel t0 level81)
(= (total-cost) 0)

(at p0 l7)
(at p1 l3)
(at p2 l1)
(at p3 l1)
(at p4 l4)
(at p5 l2)
(at p6 l0)
(at p7 l3)
)

(:goal
(and
(at p0 l6)
(at p1 l6)
(at p2 l6)
(at p3 l4)
(at p4 l1)
(at p5 l6)
(at p6 l1)
(at p7 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p0 t0 l7)
   deleted: (at p0 l7)
   added: (in p0 t0)
   goals met: 0 of 8
2. (drive t0 l7 l2 level72 level9 level81)
   deleted: (at t0 l7) (fuel t0 level81)
   added: (at t0 l2) (fuel t0 level72)
   goals met: 0 of 8
3. (drive t0 l2 l1 level71 level1 level72)
   deleted: (at t0 l2) (fuel t0 level72)
   added: (at t0 l1) (fuel t0 level71)
   goals met: 0 of 8
4. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 8
5. (drive t0 l1 l2 level70 level1 level71)
   deleted: (at t0 l1) (fuel t0 level71)
   added: (at t0 l2) (fuel t0 level70)
   goals met: 0 of 8
6. (drive t0 l2 l5 level67 level3 level70)
   deleted: (at t0 l2) (fuel t0 level70)
   added: (at t0 l5) (fuel t0 level67)
   goals met: 0 of 8
7. (drive t0 l5 l4 level58 level9 level67)
   deleted: (at t0 l5) (fuel t0 level67)
   added: (at t0 l4) (fuel t0 level58)
   goals met: 0 of 8
8. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 1 of 8
9. (load p4 t0 l4)
   deleted: (at p4 l4)
   added: (in p4 t0)
   goals met: 1 of 8
10. (drive t0 l4 l3 level43 level15 level58)
   deleted: (at t0 l4) (fuel t0 level58)
   added: (at t0 l3) (fuel t0 level43)
   goals met: 1 of 8
11. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 1 of 8
12. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 1 of 8
13. (drive t0 l3 l0 level26 level17 level43)
   deleted: (at t0 l3) (fuel t0 level43)
   added: (at t0 l0) (fuel t0 level26)
   goals met: 1 of 8
14. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 1 of 8
15. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 2 of 8
16. (drive t0 l0 l1 level25 level1 level26)
   deleted: (at t0 l0) (fuel t0 level26)
   added: (at t0 l1) (fuel t0 level25)
   goals met: 2 of 8
17. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 2 of 8
18. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 3 of 8
19. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 4 of 8
20. (drive t0 l1 l2 level24 level1 level25)
   deleted: (at t0 l1) (fuel t0 level25)
   added: (at t0 l2) (fuel t0 level24)
   goals met: 4 of 8
21. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 4 of 8
22. (drive t0 l2 l6 level6 level18 level24)
   deleted: (at t0 l2) (fuel t0 level24)
   added: (at t0 l6) (fuel t0 level6)
   goals met: 4 of 8
23. (unload p0 t0 l6)
   deleted: (in p0 t0)
   added: (at p0 l6)
   goals met: 5 of 8
24. (unload p1 t0 l6)
   deleted: (in p1 t0)
   added: (at p1 l6)
   goals met: 6 of 8
25. (unload p2 t0 l6)
   deleted: (in p2 t0)
   added: (at p2 l6)
   goals met: 7 of 8
26. (unload p5 t0 l6)
   deleted: (in p5 t0)
   added: (at p5 l6)
   goals met: 8 of 8
